In [21]:
import pandas as pd
import numpy as np
import seaborn as sns

## Planets Data from `seaborn`

In [22]:
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [23]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

## Simple Aggregation in Pandas

Pandas `Series` and `DataFrame`s include all of the common aggregates as in Numpy.

### `Series`

For a Pandas `Series` the aggregates return a single value:

In [24]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(5, size=5))
ser

0    3
1    4
2    2
3    4
4    4
dtype: int64

In [25]:
ser.sum()

17

In [26]:
ser.mean()

3.4

### `DataFrame`

For a `DataFrame`, by default the aggregates return results within each **column**:

In [27]:
df = pd.DataFrame({'A': rng.randint(5, size=5),
                   'B': rng.randint(10, size=5)})
df

   A  B
0  1  3
1  2  7
2  2  7
3  2  2
4  4  5

In [28]:
df.mean()

A    2.2
B    4.8
dtype: float64

In [29]:
df.sum()

A    11
B    24
dtype: int64

Aggregate within each row by specifying the `axis` argument:

In [30]:
# Sum over each row
df.mean(axis='columns')

0    2.0
1    4.5
2    4.5
3    2.0
4    4.5
dtype: float64

In [31]:
# Max of each row
df.max(axis=1)

0    3
1    7
2    7
3    2
4    5
dtype: int64

`describe()`:  computes several common aggregates for each column and returns the result

In [32]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [33]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

### Some built-in Pandas aggregtation

| Aggregation          | Description                     |
| :------------------- | :------------------------------ |
| `count()`            | Total number of items           |
| `first()`, `last()`  | First and last item             |
| `mean()`, `median()` | Mean and median                 |
| `min()`, `max()`     | Minimum and maximum             |
| `std()`, `var()`     | Standard deviation and variance |
| `mad()`              | Mean absolute deviation         |
| `prod()`             | Product of all items            |
| `sum()`              | Sum of all items                |

These are all methods of `DataFrame` and `Series` objects.

## GroupBy: Split, Apply, Combine

### Split, apply, combine

`groupby`:

- *Split* step: breaks up and groups a `DataFrame` depending on the value of the specified key

- *Apply* step: computes some function, usually an aggregate, transformation, or filtering, within the individual groups

- *Combine* step: merges the result of these operations into an output array.

Example:

In [34]:
from IPython.display import display, Image

Image(url='https://jakevdp.github.io/PythonDataScienceHandbook/figures/03.08-split-apply-combine.png')

The power of the `GroupBy` is that it abstracts away these steps: the user need not think about *how* the computation is done under the hood, but rather thinks about the *operation as a whole*.

In [35]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [36]:
df.groupby('key')

Notice that what is returned is not a set of `DataFrame`s, but a `DataFrameGroupBy` object. 

This object is where the magic is: **you can think of it as a special view of the `DataFrame`, which is poised to dig into the groups but does no actual computation until the aggregation is applied.** This "lazy evaluation" approach means that common aggregates can be implemented very efficiently in a way that is almost transparent to the user.

Now apply an aggregate to this `DataFrameGroupBy` object, which will perform the appropriate apply/combine steps to produce the desired result:

In [37]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

### The `GroupBy` object

We can simply treat the `GroupBy` object as if it's a collection of `DataFrame`s, and it does the difficult things under the hood.

#### Column indexing

The `GroupBy` object supports column indexing in the same way as the `DataFrame`, and returns a modified `GroupBy` object.

In [42]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [39]:
planets.groupby('method')

In [40]:
planets.groupby('method')['orbital_period']

In [41]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

#### Iteration over groups

The `GroupBy` object supports direct iteration over the groups, returning each group as a `Series` or `DataFrame`:

In [45]:
for (method, group) in planets.groupby('method'):
    print(f'{method}, shape={group.shape}')

Astrometry, shape=(2, 6)
Eclipse Timing Variations, shape=(9, 6)
Imaging, shape=(38, 6)
Microlensing, shape=(23, 6)
Orbital Brightness Modulation, shape=(3, 6)
Pulsar Timing, shape=(5, 6)
Pulsation Timing Variations, shape=(1, 6)
Radial Velocity, shape=(553, 6)
Transit, shape=(397, 6)
Transit Timing Variations, shape=(4, 6)

This can be useful for doing certain things manually.

#### Dispatch methods

Any method not explicitly implemented by the GroupBy object will be passed through and called on the groups, whether they are `DataFrame` or `Series` objects.

In [50]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

Notice that methods are applied *to each individual group*, and the results are then combined within `GroupBy` and returned.

### Aggregate, filter, transform, apply

`GroupBy` objects have `aggregate()`, `filter()`, `transform()`, and `apply()` methods that efficiently implement a variety of useful operations before combining the grouped data.

In [51]:
rng = np.random.RandomState(0)
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': rng.randint(0, 10, 6)},
                   columns = ['key', 'data1', 'data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

#### Aggregation

`aggregate()` method can take a string, a function, or a list thereof, and compute the aggregates at once.

In [52]:
df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

Another useful pattern is to pass a dictionary mapping column names to operations to be applied on that column:

In [53]:
df.groupby('key').aggregate({'data1': 'min', 'data2': 'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

#### Filtering

A filtering operation allows you to drop data based on the group properties. 

E.g.: we might want to keep all groups in which the standard deviation is larger than some critical value:

In [58]:
def filter_func(x):
    return x['data2'].std() > 4

The filter function should return a Boolean value specifying whether the group passes the filtering.

In [57]:
df.groupby('key').std()

       data1     data2
key
A    2.12132  1.414214
B    2.12132  4.949747
C    2.12132  4.242641

In [55]:
df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

Here because group A does not have a standard deviation greater than 4, it is dropped from the result.

#### Transformation

Transformation can return some transformed version of the full data to recombine. For such a transformation, the output is the same shape as the input.

In [60]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [61]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

### `apply()`

The `apply()` method lets you apply an arbitrary function to the group results. The function should take a `DataFrame`, and return either a Pandas object (e.g., `DataFrame`, `Series`) or a scalar; the combine operation will be tailored to the type of output returned.

In [62]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum()
    return x

In [63]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

`apply()` within a `GroupBy` is quite flexible: the only criterion is that the function takes a `DataFrame` and returns a Pandas object or scalar;

### Specify the split key

#### A list, array, series, or index providing the grouping keys

The key can be any series or list with a length matching that of the `DataFrame`.

In [66]:
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [75]:
L = [0, 1, 0, 1, 2, 0]
for el in df.groupby(L):
    print(el, '\n')

(0,   key  data1  data2
0   A      0      5
2   C      2      3
5   C      5      9)

(1,   key  data1  data2
1   B      1      0
3   A      3      3)

(2,   key  data1  data2
4   B      4      7)

In [76]:
df.groupby(L).sum()

   data1  data2
0      7     17
1      4      3
2      4      7

In [68]:
df.groupby(df['key']).sum() # verbose way

     data1  data2
key
A        3      8
B        5      7
C        7     12

In [71]:
df.groupby('key').sum()

     data1  data2
key
A        3      8
B        5      7
C        7     12

#### A dictionary or series mapping index to group

Provide a dictionary that maps index values to the group keys:

In [78]:
df2 = df.set_index('key')
df2

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

In [80]:
mappings = {
    'A': 'vowel',
    'B': 'consonant',
    'C': 'consonant'
}

df2.groupby(mappings).sum()

           data1  data2
consonant     12     19
vowel          3      8

#### Any Python function

Pass any Python function that will input the index value and output the group:

In [81]:
df2

     data1  data2
key
A        0      5
B        1      0
C        2      3
A        3      3
B        4      7
C        5      9

In [82]:
df2.groupby(str.lower)

   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

## Grouping Example

In [90]:
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0